# Завдання 1
def odd_or_even(num):
	try:
		n = int(num)										# int повертає цілу частину від числа
		if n != num:										# якщо число не рівне цілій частині від цього числа, то воно не ціле
			print('Функція працює лише з цілими числами')
		elif n == num and num % 2 == 0:						# якщо ціле і залишок від ділення на 2 рівний нулю
			print('Число ' + str(num) + ' є парним')
		elif n == num and num % 2 != 0:						# якщо ціле і залишок від ділення на 2 не рівний нулю
			print('Число ' + str(num) + ' є непарним')
	except ValueError:										# якщо при приведенні до числа виникла помилка
		print('Функція працює лише з цілими числами')


odd_or_even(12)
odd_or_even(17)
odd_or_even(-8)
odd_or_even(3.14)
odd_or_even('some text')
