# Завдання 2
def transform_str(s):
    try:
        s = str(s)                          # приведення до рядкового типу на випадок якщо буде передано число
        if len(s) > 5:                      # якщо довжина рядка більше 5 символів
            s = s[0:5] + '...'              # то рядок обрізається з 0 до 5 символу і додається три крапки
        if s[0] == 'U' or s[0] == 'u':      # якщо рядок починається (його символ з індексом 0) дорівнює U або u
            s = s.upper()                   # то всі символи рядка переводяться у верхній регістр
        elif s[0] == 'L' or s[0] == 'l':    # інакше якщо рядок починається (його символ з індексом 0) дорівнює L або l
            s = s.lower()                   # то всі символи рядка переводяться у нижній регістр
        print(s)                            # вивід рядка після можливих обробок
    except ValueError:                      # якщо виникла помилка
        print('Error')


transform_str('Testing string')
transform_str('Lux')
transform_str('up')
transform_str('Luxery')
transform_str(5)
