# Завдання 3
def sum_num(num: int):
    num = abs(num)                  # беремо значення модуля числа на випадок якщо воно було менше нуля
    s = str(num)                    # перетворюємо число в рядок
    while len(s) > 1:               # поки довжина рядка більше 1 символу виконується наступне
        suma = 0                    # спочатку сума задається рівною нулю
        for digit in s:             # потім для кожного символу рядка
            suma += int(digit)      # сума збільшується на значення символу приведеного до числа
        s = str(suma)               # приведення числа суми до рядка для перевірки умови while знову
    return int(s)                   # коли умова while виконана, приводимо результат до числового типу і повертаємо його


print(sum_num(38) == 2)
print(sum_num(40) == 4)
print(sum_num(48) == 3)
print(sum_num(2) == 2)
print(sum_num(-88) == 7)
