# Завдання 4
def common_str(str1, str2):
    s1 = set(str1.replace(' ', ''))     # прибераємо з рядка пробіли (замінюючи їх на пустий рядок)
    s2 = set(str2.replace(' ', ''))     # і оскільки по умові задачі порядок символів не грає ролі перетворюємо рядок в множину
    common = s1.intersection(s2)        # в якості перетину множин отримуємо множину зі спільних унікальних символів початкових рядків
    return ''.join(common)              # повертається пустий рядок до якого додаються спільні унікальні символи початкових рядків (якщо вони є) приведені до рядкового типу


print(common_str('loli', 'luck') == 'l')
print(common_str('good day', 'good morning') == 'god')
